In [1]:
import pandas as pd
import numpy as np

1. Загрузити файл з даними про споживання енергії “En_In.xls”, який являє
собою перелік показників енергозабезпечення та виробництва відновлюваної
електроенергії, і ввести їх в DataFrame.

In [2]:
data=pd.read_excel("En_In.xls",names=['1','2','Country','EnergySup','EnergySupprCap','%Renewable'])
data=data[17:244][['Country','EnergySup','EnergySupprCap','%Renewable']]

data

                       Country EnergySup EnergySupprCap %Renewable
17                 Afghanistan       321             10   78.66928
18                     Albania       102             35        100
19                     Algeria      1959             51    0.55101
20              American Samoa       ...            ...   0.641026
21                     Andorra         9            121   88.69565
..                         ...       ...            ...        ...
239                   Viet Nam      2554             28   45.32152
240  Wallis and Futuna Islands         0             26          0
241                      Yemen       344             13          0
242                     Zambia       400             26   99.71467
243                   Zimbabwe       480             32   52.53612

[227 rows x 4 columns]

In [3]:
mask = data[['EnergySup','EnergySupprCap','%Renewable']].applymap(lambda x: isinstance(x, (int, float)))
data[['EnergySup','EnergySupprCap','%Renewable']]=data[['EnergySup','EnergySupprCap','%Renewable']].where(mask)
data

                       Country EnergySup EnergySupprCap %Renewable
17                 Afghanistan       321             10   78.66928
18                     Albania       102             35        100
19                     Algeria      1959             51    0.55101
20              American Samoa       NaN            NaN   0.641026
21                     Andorra         9            121   88.69565
..                         ...       ...            ...        ...
239                   Viet Nam      2554             28   45.32152
240  Wallis and Futuna Islands         0             26          0
241                      Yemen       344             13          0
242                     Zambia       400             26   99.71467
243                   Zimbabwe       480             32   52.53612

[227 rows x 4 columns]

2. Переведіть дані із стовпчику ‘Energy Supply’ в гДж (Примітка: в 1ПДж
= 1000000 ГДж). Для всіх країн, у яких відсутні дані (наприклад, дані з
"....."), переконайтеся, що це відображається як значення np.NaN.

In [4]:
data.EnergySup=data.EnergySup*1000000
data

                       Country   EnergySup EnergySupprCap %Renewable
17                 Afghanistan   321000000             10   78.66928
18                     Albania   102000000             35        100
19                     Algeria  1959000000             51    0.55101
20              American Samoa         NaN            NaN   0.641026
21                     Andorra     9000000            121   88.69565
..                         ...         ...            ...        ...
239                   Viet Nam  2554000000             28   45.32152
240  Wallis and Futuna Islands           0             26          0
241                      Yemen   344000000             13          0
242                     Zambia   400000000             26   99.71467
243                   Zimbabwe   480000000             32   52.53612

[227 rows x 4 columns]

3. Існує декілька країн, що мають в назві цифри та/або дужки. Обов’язково
видаліть їх, напр. 'Bolivia (Plurinational State of)' повинна бути
‘Bolivia’, ‘Switzerland17’ повинна бути Switzerland’.

In [5]:
data.Country=data['Country'].str.replace(r" \(.*\)","",regex=True)
data.Country=data['Country'].str.replace(r"\d+","",regex=True)

4. Перейменуйте наступний список країн:
"Republic of Korea": "South Korea",
"United States of America": "United States",
"United Kingdom of Great Britain and Northern Ireland":
"United Kingdom",
"China, Hong Kong Special Administrative Region": "Hong Kong"

In [6]:
data.Country[data.Country=='Republic of Korea']='South Korea'
data.Country[data.Country=='United States of America']='United States'
data.Country[data.Country=='United Kingdom of Great Britain and Northern Ireland']='United Kingdom'
data.Country[data.Country=='China, Hong Kong Special Administrative Region']='Hong Kong'

In [7]:
data[data.Country.isin(['American Samoa','South Korea','Bolivia'])]

            Country    EnergySup EnergySupprCap %Renewable
20   American Samoa          NaN            NaN   0.641026
41          Bolivia    336000000             32   31.47712
181     South Korea  11007000000            221   2.279353

5. Далі, завантажте дані про ВВП з файлу „gpd.csv”, що містить дані
Світового банку про ВВП країн від 1960 до 2015 року.
Обов’язково не включайте заголовок до датафрейму і перейменуйте
наступний список країн:
"Korea, Rep.": "South Korea",
"Iran, Islamic Rep.": "Iran",
"Hong Kong SAR, China": "Hong Kong"

In [15]:
gpd=pd.read_csv('gpd.csv',header=4)
gpd['Country Name']=gpd['Country Name'].str.replace('Korea, Rep.','South Korea')
gpd['Country Name']=gpd['Country Name'].str.replace('Iran, Islamic Rep.','Iran')
gpd['Country Name']=gpd['Country Name'].str.replace('Hong Kong SAR, China','Hong Kong')

/tmp/ipykernel_9277/2141628572.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  gpd['Country Name']=gpd['Country Name'].str.replace('Korea, Rep.','South Korea')
/tmp/ipykernel_9277/2141628572.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  gpd['Country Name']=gpd['Country Name'].str.replace('Iran, Islamic Rep.','Iran')

In [16]:
gpd.head(1)

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,Aruba,ABW,GDP at market prices (constant 2010 US$),NY.GDP.MKTP.KD,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,2.467704e+09,NaN,NaN,NaN,NaN,NaN

6. Завантажте дані з файлу „scimagojr.xlsx”, який класифікує країни на основі
їхніх публікацій в журналах у галузі енергетичного машинобудування та
енергетичних технологій.

In [17]:
jr=pd.read_excel('scimagojr.xlsx')
jr

,Rank,Country,Documents,Citable documents,Citations,Self-citations,Citations per document,H index
0,1,China,127050,126767,597237,411683,4.70,138
1,2,United States,96661,94747,792274,265436,8.20,230
2,3,Japan,30504,30287,223024,61554,7.31,134
3,4,United Kingdom,20944,20357,206091,37874,9.84,139
4,5,Russian Federation,18534,18301,34266,12422,1.85,57
...,...,...,...,...,...,...,...,...
186,187,Guyana,1,1,0,0,0.00,0
187,188,Christmas Island,1,1,0,0,0.00,0
188,189,Reunion,1,1,2,1,2.00,1
189,190,Saint Lucia,1,1,0,0,0.00,0
190,191,Mauritania,1,1,1,0,1.00,1

7. Приєднайте три набори даних із завдань 1-6 до нового набору даних
(використовуючи перетин назв країн

In [18]:
jr

,Rank,Country,Documents,Citable documents,Citations,Self-citations,Citations per document,H index
0,1,China,127050,126767,597237,411683,4.70,138
1,2,United States,96661,94747,792274,265436,8.20,230
2,3,Japan,30504,30287,223024,61554,7.31,134
3,4,United Kingdom,20944,20357,206091,37874,9.84,139
4,5,Russian Federation,18534,18301,34266,12422,1.85,57
...,...,...,...,...,...,...,...,...
186,187,Guyana,1,1,0,0,0.00,0
187,188,Christmas Island,1,1,0,0,0.00,0
188,189,Reunion,1,1,2,1,2.00,1
189,190,Saint Lucia,1,1,0,0,0.00,0
190,191,Mauritania,1,1,1,0,1.00,1